In [1]:
import pandas as pd
df = pd.read_csv("C:/Users/Tcs/Downloads/employees.csv")

In [2]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,08-06-1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,03-04-2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [4]:
d = pd.DataFrame(df)

In [5]:
print(d['Gender'])

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [6]:
print(d.columns)

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [7]:
print(d.shape)

(1000, 8)

In [8]:
print(d[9:11])

   First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
9     Frances  Female  08-08-2002         6:51 AM  139852    7.524
10     Louise  Female  08-12-1980         9:01 AM   63241   15.132

   Senior Management                  Team
9               True  Business Development
10              True                   NaN

In [9]:
print(d.loc[45])

First Name               Roger
Gender                    Male
Start Date           4/17/1980
Last Login Time       11:32 AM
Salary                   88010
Bonus %                 13.886
Senior Management         True
Team                     Sales
Name: 45, dtype: object

In [11]:
print(d.loc[d['Bonus %']==6.945])

  First Name Gender  Start Date Last Login Time  Salary  Bonus %  \
0    Douglas   Male  08-06-1993        12:42 PM   97308    6.945

  Senior Management       Team
0              True  Marketing